{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "DualModel", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 155], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.unstack_1", "trainable": true, "dtype": "float32", "function": "unstack"}, "name": "tf.unstack_1", "inbound_nodes": [["input_2", 0, 0, {"num": 10, "axis": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_2", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_2", "inbound_nodes": [[["tf.unstack_1", 0, 0, {"axis": 1}], ["tf.unstack_1", 0, 1, {"axis": 1}], ["tf.unstack_1", 0, 2, {"axis": 1}], ["tf.unstack_1", 0, 3, {"axis": 1}], ["tf.unstack_1", 0, 4, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.stack_3", "trainable": true, "dtype": "float32", "function": "stack"}, "name": "tf.stack_3", "inbound_nodes": [[["tf.unstack_1", 0, 5, {"axis": 1}], ["tf.unstack_1", 0, 6, {"axis": 1}], ["tf.unstack_1", 0, 7, {"axis": 1}], ["tf.unstack_1", 0, 8, {"axis": 1}], ["tf.unstack_1", 0, 9, {"axis": 1}]]]}, {"class_name": "Sequential", "config": {"name": "StatsModel", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 155], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_2_input"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "batch_input_shape": [null, 155], "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 22, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "StatsModel", "inbound_nodes": [[["tf.unstack_1", 0, 0, {}]], [["tf.unstack_1", 0, 1, {}]], [["tf.unstack_1", 0, 2, {}]], [["tf.unstack_1", 0, 3, {}]], [["tf.unstack_1", 0, 4, {}]], [["tf.unstack_1", 0, 5, {}]], [["tf.unstack_1", 0, 6, {}]], [["tf.unstack_1", 0, 7, {}]], [["tf.unstack_1", 0, 8, {}]], [["tf.unstack_1", 0, 9, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_2", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_2", "inbound_nodes": [["tf.stack_2", 0, 0, {"axis": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_3", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_3", "inbound_nodes": [["tf.stack_3", 0, 0, {"axis": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean", "inbound_nodes": [[["StatsModel", 1, 0, {"axis": 0}], ["StatsModel", 2, 0, {"axis": 0}], ["StatsModel", 3, 0, {"axis": 0}], ["StatsModel", 4, 0, {"axis": 0}], ["StatsModel", 5, 0, {"axis": 0}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_min", "trainable": true, "dtype": "float32", "function": "math.reduce_min"}, "name": "tf.math.reduce_min", "inbound_nodes": [[["StatsModel", 1, 0, {"axis": 0}], ["StatsModel", 2, 0, {"axis": 0}], ["StatsModel", 3, 0, {"axis": 0}], ["StatsModel", 4, 0, {"axis": 0}], ["StatsModel", 5, 0, {"axis": 0}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_max", "trainable": true, "dtype": "float32", "function": "math.reduce_max"}, "name": "tf.math.reduce_max", "inbound_nodes": [[["StatsModel", 1, 0, {"axis": 0}], ["StatsModel", 2, 0, {"axis": 0}], ["StatsModel", 3, 0, {"axis": 0}], ["StatsModel", 4, 0, {"axis": 0}], ["StatsModel", 5, 0, {"axis": 0}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_1", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_1", "inbound_nodes": [[["StatsModel", 6, 0, {"axis": 0}], ["StatsModel", 7, 0, {"axis": 0}], ["StatsModel", 8, 0, {"axis": 0}], ["StatsModel", 9, 0, {"axis": 0}], ["StatsModel", 10, 0, {"axis": 0}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_min_1", "trainable": true, "dtype": "float32", "function": "math.reduce_min"}, "name": "tf.math.reduce_min_1", "inbound_nodes": [[["StatsModel", 6, 0, {"axis": 0}], ["StatsModel", 7, 0, {"axis": 0}], ["StatsModel", 8, 0, {"axis": 0}], ["StatsModel", 9, 0, {"axis": 0}], ["StatsModel", 10, 0, {"axis": 0}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_max_1", "trainable": true, "dtype": "float32", "function": "math.reduce_max"}, "name": "tf.math.reduce_max_1", "inbound_nodes": [[["StatsModel", 6, 0, {"axis": 0}], ["StatsModel", 7, 0, {"axis": 0}], ["StatsModel", 8, 0, {"axis": 0}], ["StatsModel", 9, 0, {"axis": 0}], ["StatsModel", 10, 0, {"axis": 0}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_3", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_3", "inbound_nodes": [[["tf.math.reduce_sum_2", 0, 0, {"axis": 1}], ["tf.math.reduce_sum_3", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_1", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_1", "inbound_nodes": [[["tf.math.reduce_mean", 0, 0, {"axis": 1}], ["tf.math.reduce_min", 0, 0, {"axis": 1}], ["tf.math.reduce_max", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_2", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_2", "inbound_nodes": [[["tf.math.reduce_mean_1", 0, 0, {"axis": 1}], ["tf.math.reduce_min_1", 0, 0, {"axis": 1}], ["tf.math.reduce_max_1", 0, 0, {"axis": 1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat_4", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat_4", "inbound_nodes": [[["tf.concat_3", 0, 0, {"axis": 1}], ["tf.concat_1", 0, 0, {"axis": 1}], ["tf.concat_2", 0, 0, {"axis": 1}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["tf.concat_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_5", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 5e-05, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_2/kernel", "shape": [155, 128], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [128, 22], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [22], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [442, 100], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [100, 1], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [1], "dtype": "float32"}]}]}